{
  "backend/main.mo": "Actor handling user profiles with authorization plus generators for test cases, bugs, and corner cases tied to website records.",
  "backend/migration.mo": "Stub migration module returning an empty state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files and components with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across the project.",
  "frontend/DEPLOY_MAINNET.md": "Guide detailing prerequisites and steps for deploying the app to IC mainnet.",
  "frontend/DEPLOYMENT_LINKS.md": "Auto‑generated file meant to store mainnet deployment URLs and canister IDs.",
  "frontend/index.css": "Global Tailwind styles defining light/dark theme tokens and base CSS resets.",
  "frontend/index.html": "Base HTML document loading the React app via main.tsx.",
  "frontend/scripts/domainName.js": "CLI utility for validating and normalizing domain names according to IC constraints.",
  "frontend/scripts/publishMainnetAndRecord.js": "Automated script to validate app name, deploy to mainnet, fetch canister IDs, and record deployment artifacts.",
  "frontend/scripts/recordDeploymentArtifact.js": "CLI script that resolves canister IDs and regenerates DEPLOYMENT_LINKS.md with deployment URLs and metadata.",
  "frontend/src/App.tsx": "Configures the app's router, defining all main routes for dashboard, bugs, test cases, test runs, and web app testing with layout and auth guards.",
  "frontend/src/components/AppShell.tsx": "Layout component providing the header, navigation, footer, and container structure for all pages.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button that manages Internet Identity authentication and clears cached queries on logout.",
  "frontend/src/components/RequireAuth.tsx": "Wrapper that restricts access to authenticated users, showing a login prompt or loading state when needed.",
  "frontend/src/components/SectionPage.tsx": "Section layout component that displays a page title, optional description and actions, and wrapped content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor tied to the current identity and invalidates queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and hook managing Internet Identity login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, websites, and test cases via an actor client.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and global styles.",
  "frontend/src/lib/urlValidation.ts": "Validates and normalizes URLs, ensuring protocol and hostname correctness.",
  "frontend/src/lib/utils.ts": "Utility wrapper combining clsx and tailwind-merge for merging class names.",
  "frontend/src/lib/websiteSelection.ts": "Manages selected website ID using URL parameters and localStorage.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, identity provider, and global styles.",
  "frontend/src/pages/BugDetailPage.tsx": "Displays detailed information about a specific bug using mock data.",
  "frontend/src/pages/BugListPage.tsx": "Lists bugs for the selected website and handles empty, loading, and no-selection states.",
  "frontend/src/pages/BugUpsertPage.tsx": "Form page for creating or editing a bug with client-side state and submission handling.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing QA stats, recent activity, and quick navigation actions.",
  "frontend/src/pages/TestCaseDetailPage.tsx": "Displays detailed information for a specific test case using mock data.",
  "frontend/src/pages/TestCaseListPage.tsx": "Lists test cases for the selected website with handling for loading and empty states.",
  "frontend/src/pages/TestCaseUpsertPage.tsx": "Form page for creating or editing a test case with local state and mock submission.",
  "frontend/src/pages/TestRunCreatePage.tsx": "Allows users to name a test run and select test cases to include before creating it.",
  "frontend/src/pages/TestRunExecutePage.tsx": "Guides users through executing tests in a run, recording pass/fail results and notes.",
  "frontend/src/pages/TestRunListPage.tsx": "Displays a list of mock test runs with status badges and navigation to create or view individual runs.",
  "frontend/src/pages/TestRunSummaryPage.tsx": "Shows a detailed summary of a single test run, including pass/fail counts and individual result cards.",
  "frontend/src/pages/WebAppTestingPage.tsx": "Implements the URL‑based test data generator and CRUD interface for test cases, bugs, and corner cases tied to selected websites.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/src/vite-env.d.ts": "Defines Vite environment variable typings for build-time configuration.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, color tokens, plugins, and content scanning paths.",
  "project_state.json": "Describes the project’s state, feature requirements, known issues, and pending requests for the URL-based testing generator workflow."
}