{
  "backend/main.mo": "Main canister actor handling authorization, user profiles, and website testing data generation with IDs and data structures for test cases, bugs, and corner cases.",
  "backend/migration.mo": "Migration module computing max IDs across stored website data and updating the actor state to maintain ID continuity.",
  "feature_evidence.json": "Report mapping implemented features to associated frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files including pages, hooks, config, and components.",
  "frontend/DEPLOY_MAINNET.md": "Guide outlining prerequisites and steps for deploying the app to the Internet Computer mainnet.",
  "frontend/DEPLOYMENT_LINKS.md": "Auto-generated mainnet deployment links file showing public app URL and canister IDs, currently placeholder content.",
  "frontend/index.css": "Global Tailwind-based theme definitions including OKLCH color tokens for light and dark mode.",
  "frontend/index.html": "Base HTML entry point loading the React app via main.tsx.",
  "frontend/scripts/domainName.js": "Node script that validates and normalizes domain names for IC deployment, including CLI usage and error reporting.",
  "frontend/scripts/publishMainnetAndRecord.js": "Automates IC mainnet deployment, validates app name, deploys via dfx, retrieves canister IDs, and records deployment artifacts.",
  "frontend/scripts/recordDeploymentArtifact.js": "Parses CLI/env args to get canister IDs, resolves IDs via dfx if needed, and generates/updates deployment markdown metadata.",
  "frontend/src/App.tsx": "Defines the main React router structure, layouts, and authenticated routes for dashboard, bugs, test cases, and test runs.",
  "frontend/src/components/AppShell.tsx": "Provides the main application layout with navigation, header, footer, and responsive sidebar.",
  "frontend/src/components/LoginButton.tsx": "Handles user authentication via Internet Identity with login/logout button logic.",
  "frontend/src/components/RequireAuth.tsx": "Wraps protected pages, showing loading or login prompts when the user is not authenticated.",
  "frontend/src/components/SectionPage.tsx": "Simple layout component for section pages with title, description, actions, and content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor using user identity, initializing access control and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, loading identities, and handling login states. Includes helpers to create an AuthClient and expose login, clear, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, websites, test cases, and related testing data via an actor API. Automatically manages cache invalidation and loading states.",
  "frontend/src/index.css": "Configures Tailwind base styles and extensive CSS variables for light and dark themes. Sets global background, typography, and border defaults.",
  "frontend/src/lib/urlValidation.ts": "Validates URLs for correct format and protocol, returning normalized results or descriptive errors. Ensures presence of hostname and basic domain rules.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge. Simplifies conditional Tailwind class composition.",
  "frontend/src/lib/websiteSelection.ts": "Manages reading and writing the selected website ID using URL parameters and localStorage. Keeps selection synced with browser state.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider. Mounts the root component and loads global styles.",
  "frontend/src/pages/BugDetailPage.tsx": "Displays detailed information for a specific bug within a selected website, including error states and navigation options. Fetches website data and validates bug existence.",
  "frontend/src/pages/BugListPage.tsx": "Shows a list of bugs for the selected website with loading and empty states, providing navigation to bug details. Fetches website data and renders interactive bug cards.",
  "frontend/src/pages/BugUpsertPage.tsx": "Form page for adding or editing a bug, loading website data and handling missing website or bug cases.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing stats, recent activity, and quick action buttons with navigation.",
  "frontend/src/pages/TestCaseDetailPage.tsx": "Displays details for a selected test case with loading and not-found handling and edit/back actions.",
  "frontend/src/pages/TestCaseListPage.tsx": "Lists all test cases for the selected website with loading, empty state, and navigation to detail pages.",
  "frontend/src/pages/TestCaseUpsertPage.tsx": "Form page for creating or editing a test case, including loading states and validation for missing website or test case.",
  "frontend/src/pages/TestRunCreatePage.tsx": "UI for creating a test run with a name and selected test cases, using mock data and navigation after submission.",
  "frontend/src/pages/TestRunExecutePage.tsx": "Executes a test run step‑by‑step, records pass/fail results with notes, and navigates on completion using mock data.",
  "frontend/src/pages/TestRunListPage.tsx": "Displays a list of test runs with status badges and navigation to run details or creation.",
  "frontend/src/pages/TestRunSummaryPage.tsx": "Shows completed test run summary including counts, pass rate, and individual test results using mock data.",
  "frontend/src/pages/WebAppTestingPage.tsx": "Manages website testing data generation, selection, and CRUD operations for test cases, bugs, and corner cases.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters and session values.",
  "frontend/src/vite-env.d.ts": "Type definitions for Vite environment variables accessible via import.meta.env.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending typography, colors, fonts, shadows, keyframes, and container settings with custom theme variables.",
  "project_state.json": "Project state metadata listing issues, existing features, new feature requests, and versioning info for ongoing development."
}