{
  "backend/main.mo": "Minimal Internet Computer backend actor with no logic, relying on dfx tooling for deployment and functionality.",
  "feature_evidence.json": "Structured report documenting completed deployment-related features, associated files, components, test requirements, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten mapping of frontend file paths to concise descriptions covering configuration, UI components, pages, styles, and deployment scripts.",
  "frontend/DEPLOY_MAINNET.md": "Step-by-step guide for deploying the QA Management app to the Internet Computer mainnet, including prerequisites and automated scripts.",
  "frontend/DEPLOYMENT_LINKS.md": "Auto-generated markdown file intended to store the latest mainnet deployment URLs and frontend/backend canister IDs.",
  "frontend/index.css": "Global Tailwind CSS styles defining light and dark themes with extensive OKLCH color tokens and base layout styling.",
  "frontend/index.html": "Vite HTML entry point that defines the root element and loads the React application bundle.",
  "frontend/scripts/domainName.js": "Node.js utility and CLI for validating and normalizing app/domain names to meet IC mainnet naming constraints.",
  "frontend/scripts/publishMainnetAndRecord.js": "Automation script that validates the app name, deploys canisters to IC mainnet via dfx, retrieves canister IDs, and records deployment artifacts.",
  "frontend/scripts/recordDeploymentArtifact.js": "Node.js script that resolves canister IDs and updates DEPLOYMENT_LINKS.md with public URLs, IDs, and deployment metadata.",
  "frontend/src/App.tsx": "Defines the root application component and sets up all routes using TanStack Router, including dashboard, bugs, test cases, and test runs. Wraps routes with theme provider, app shell layout, and global toaster.",
  "frontend/src/components/AppShell.tsx": "Provides the main application layout with header, responsive navigation, main content area, and footer. Handles navigation highlighting and routing via TanStack Router.",
  "frontend/src/components/SectionPage.tsx": "Reusable page layout component that renders a title, optional description and actions, and page content with consistent spacing and styling.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity, returning an anonymous actor when unauthenticated. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements authentication context and provider for DFINITY Internet Identity, managing login, logout, identity persistence, and status flags. Exposes a hook to access identity state and auth actions throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Contains example React Query hooks demonstrating how to query and mutate backend data using the actor from useActor. Serves as a template for real backend integrations.",
  "frontend/src/index.css": "Global Tailwind CSS configuration defining light and dark theme color variables, typography, and base styles for the application.",
  "frontend/src/lib/utils.ts": "Utility function that merges conditional class names using clsx and tailwind-merge to avoid Tailwind style conflicts.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wrapping it with React Query and Internet Identity providers and loading global styles.",
  "frontend/src/pages/BugDetailPage.tsx": "Page component that displays detailed information about a single bug, including description, steps, and metadata, using mock data. Provides navigation actions to go back or edit the bug.",
  "frontend/src/pages/BugListPage.tsx": "Renders a list view of bugs with severity, status, and priority badges using mock data, including empty-state handling. Provides navigation to bug detail pages and a page to report new bugs.",
  "frontend/src/pages/BugUpsertPage.tsx": "Implements a create/edit bug form with fields for severity, status, priority, and details, driven by local state. On submit, shows a success toast and navigates back to the bug list.",
  "frontend/src/pages/DashboardPage.tsx": "Displays a dashboard overview with clickable stat cards, recent activity feed, and quick action buttons. Uses mock statistics and activity data to navigate to bugs, test cases, and test runs.",
  "frontend/src/pages/TestCaseDetailPage.tsx": "Shows detailed information for a single test case, including description, preconditions, steps, expected results, and metadata. Provides actions to go back to the list or edit the test case.",
  "frontend/src/pages/TestCaseListPage.tsx": "Renders a list of test cases with category, priority, and status badges using mock data, including an empty state. Allows navigation to test case details and creation pages.",
  "frontend/src/pages/TestCaseUpsertPage.tsx": "Provides a form for creating or editing test cases with fields for metadata and test steps, managed via local state. On submit, shows a toast notification and navigates back to the test case list.",
  "frontend/src/pages/TestRunCreatePage.tsx": "React page for creating a new test run, allowing users to name the run and select test cases from a mocked list. Handles basic validation, shows toast notifications, and navigates back to the test run list on success.",
  "frontend/src/pages/TestRunExecutePage.tsx": "React page for executing a test run step by step, displaying test steps, capturing pass/fail results with notes, and tracking progress using local state and mock data.",
  "frontend/src/pages/TestRunListPage.tsx": "Lists existing test runs with status badges and summary metrics using mocked data, and provides navigation to create new runs or view individual run details.",
  "frontend/src/pages/TestRunSummaryPage.tsx": "Displays a completed test run summary including pass/fail counts, pass rate, execution metadata, and per-test results with notes using mock data.",
  "frontend/src/vite-env.d.ts": "TypeScript declaration file extending Vite's ImportMetaEnv with environment variables for backend canister IDs and Internet Identity configuration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, dark mode, theme extensions (colors, fonts, radii, shadows), and plugins for typography, container queries, and animations.",
  "project_state.json": "Machine-readable snapshot of the project's current state, summarizing the ICP-based QA management app architecture and enumerating implemented frontend and backend features with versioning."
}