{
  "kind": "build_request",
  "title": "Expand generated bug/scenario content and remove mock pages so all website content is shown",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Expand the backend template-based generator so that generating test data for a website produces a comprehensive baseline set of (a) test cases, (b) bugs, and (c) corner/edge-case scenarios instead of only a few items.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "in this website only few contents are giving ,please give all bugs and all scenario"
        ]
      },
      "acceptanceCriteria": [
        "Calling generateWebsiteTestingData(url, title) creates a noticeably larger baseline dataset (e.g., dozens of items) across testCases, bugs, and cornerCases for the created Website record.",
        "Generated items cover multiple common web-app areas (navigation, forms, auth/session, permissions, content, responsive/mobile, performance, accessibility, error states, etc.) rather than only generic placeholders.",
        "Generation remains deterministic/template-based (no crawling/fetching of the target URL’s live content)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix backend ID assignment so all generated TestCase/Bug/CornerCase records have unique IDs and the next*Id counters are correctly incremented during generation (not just during manual add mutations).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "only few contents are giving"
        ]
      },
      "acceptanceCriteria": [
        "Within a single website’s generated dataset, no two items share the same id for test cases, bugs, or corner cases.",
        "Across multiple generateWebsiteTestingData calls, ids do not collide (each subsequent generation uses new ids).",
        "Manual add/edit/delete operations continue to work with the generated ids (no broken updates/deletes due to duplicate ids)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Replace mock-data usage in BugDetailPage/TestCaseDetailPage (and related upsert pages if they use mock submission) so that detail/edit views display and edit the real items from the selected website stored in the backend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "only few contents are giving"
        ]
      },
      "acceptanceCriteria": [
        "Navigating from a bug/test case list to its detail page shows the actual selectedWebsite item data (description/steps/severity, etc.), not placeholder/mock content.",
        "Editing a bug/test case from its edit page persists changes via existing backend mutations and is reflected when returning to the list and the generator page.",
        "If no selected website is set or the item id is not found, the UI shows a clear English empty/error state with a link back to /web-app-testing."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure all pages that read generated content (Web App Testing, Bugs list, Test Cases list) clearly render the full generated datasets and provide basic UX to handle large lists (at minimum: loading states remain correct and lists are scrollable without truncation).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "please give all bugs and all scenario"
        ]
      },
      "acceptanceCriteria": [
        "After generating a website, the Web App Testing page shows all generated test cases/bugs/corner cases in their respective tabs without cutting off items.",
        "The Bugs and Test Cases pages display all items associated with the currently selected website id.",
        "Large lists remain usable (no missing items due to rendering or state issues)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not modify any files under frontend/src/components/ui or any other immutable paths listed in SYSTEM_CONTEXT.",
    "Do not crawl/fetch/parse the target website content; generation must stay template-based and offline."
  ],
  "nonGoals": [
    "Implementing real-time collaboration or chat.",
    "Integrating third-party auth providers (only Internet Identity is allowed).",
    "Adding external databases or non-Motoko backend components."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}