{
  "kind": "build_request",
  "title": "Add URL-based test plan generator with Auto + Manual workflow",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new \"Web App Testing\" generator flow where a user can paste a website URL, click \"Generate\", and receive (a) generated test cases, (b) a generated bug list, and (c) generated corner/edge cases for that target website.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2",
          "msg-3",
          "msg-4",
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "copy the website link and paste into it and i need test case, bug list ,corner cases all functionalities",
          "type 1",
          "i need to to test my project in this new website .. how will i paste the link",
          "\"Auto + Manual\" (paste link → get results + you can add your own)",
          "yes please generate"
        ]
      },
      "acceptanceCriteria": [
        "Frontend provides a URL input field and a primary \"Generate\" action.",
        "URL is validated client-side (must be http/https and a valid hostname); invalid input blocks generation with a clear error message.",
        "Submitting a valid URL results in visible generated outputs for: test cases, bug list, and corner cases.",
        "Generation works without using any external AI/LLM services or third-party APIs."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement backend data models and persistence for \"target websites\" and their generated artifacts so each user can generate and revisit results for multiple URLs over time.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-6"
        ],
        "quotes": [
          "copy the website link and paste into it and i need test case, bug list ,corner cases all functionalities",
          "yes please generate"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes methods to create/list/get target website entries (at minimum: id, url, createdAt, updatedAt).",
        "Backend stores generated test cases, generated bug suggestions, and generated corner cases associated to a target website id.",
        "All stored data is scoped to the calling principal (one user cannot read/modify another user’s targets and artifacts).",
        "After a page refresh, previously generated targets and artifacts can be reloaded from the backend."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement deterministic, template-based generation logic that produces a reasonable baseline set of test cases, bug suggestions, and corner cases from a URL, without attempting to crawl or fetch the target website content.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "copy the website link and paste into it and i need test case, bug list ,corner cases all functionalities",
          "\"Auto + Manual\" (paste link → get results + you can add your own)"
        ]
      },
      "acceptanceCriteria": [
        "Backend generation creates at least: 20+ test cases, 10+ bug suggestions, and 10+ corner cases for a new URL.",
        "Generated items include clear English titles and step-by-step content (where applicable), not just single-line bullets.",
        "Generated items include a mix of functional areas commonly applicable to web apps (e.g., navigation, forms, auth patterns, error states, accessibility, responsiveness, performance/smoke checks) while remaining generic (no claims about site-specific features).",
        "Generation output is stable for the same URL (same input URL yields the same output unless a version/seed is explicitly changed)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add an \"Auto + Manual\" workflow: after generation, allow users to review and manually add/edit/delete test cases and bugs within the app UI, starting from the generated baseline for a given target website.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "\"Auto + Manual\" (paste link → get results + you can add your own)"
        ]
      },
      "acceptanceCriteria": [
        "From a generated results view, the user can: edit a generated test case, add a new test case, and delete a test case; changes persist to the backend.",
        "From a generated results view, the user can: edit a generated bug suggestion, add a new bug, and delete a bug; changes persist to the backend.",
        "Manual edits do not get overwritten when the user revisits the same target website’s results.",
        "UI clearly distinguishes generated items vs user-edited/user-created items (e.g., label or badge)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Integrate the generator into the existing navigation and routing so users can easily access it, and connect existing Test Cases / Bugs areas to the selected target website context.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "i need to to test my project in this new website .. how will i paste the link",
          "yes please generate"
        ]
      },
      "acceptanceCriteria": [
        "A new navigation entry exists (e.g., \"Web App Testing\" or \"Generator\") that routes to the generator page.",
        "Generator page includes a way to see/select previously created target websites (history list) and open their generated results.",
        "When a target website is selected, the UI shows test cases, bug list, and corner cases for that target website.",
        "User-facing text across the generator pages is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no multi-canister or microservices architecture).",
    "Do not edit files under frontend/src/components/ui (compose existing shadcn components instead).",
    "Do not modify frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui.",
    "Do not use external databases or third-party AI/LLM APIs; generation must be implemented within the app (deterministic/template-based)."
  ],
  "nonGoals": [
    "Crawling, scraping, or fetching the target website’s HTML to infer real features.",
    "Automated dynamic testing of the pasted URL (no browser automation, no Playwright/Selenium integration).",
    "Real-time collaboration, chat, or WebSocket-driven updates.",
    "Third-party authentication providers (only Internet Identity is allowed)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}