{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Show full generated QA content and replace mock detail/edit pages with real backend data",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Replace mock bug/test-case detail + edit pages with real selected-website data and persist edits via backend mutations",
      "acceptanceCriteria": [
        "Navigating from a bug/test case list to its detail page shows the actual selectedWebsite item data (description/steps/severity, etc.), not placeholder/mock content.",
        "Editing a bug/test case from its edit page persists changes via existing backend mutations and is reflected when returning to the list and the generator page.",
        "If no selected website is set or the item id is not found, the UI shows a clear English empty/error state with a link back to /web-app-testing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BugDetailPage.tsx",
          "operation": "modify",
          "description": "Remove mock bug object and load the real Bug by (a) reading the current selected website id (websiteSelection) and (b) fetching the Website via useGetWebsite, then finding the bug by the route bugId. Render actual backend fields (description + severity) and provide a clear not-found / no-website-selected state with a link back to /web-app-testing. Use existing shadcn/ui components already imported for layout; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TestCaseDetailPage.tsx",
          "operation": "modify",
          "description": "Remove mock test case object and load the real TestCase by selected website id + useGetWebsite, then find by route testCaseId. Render actual backend fields (description + steps) and provide a clear not-found / no-website-selected state with a link back to /web-app-testing. Use existing shadcn/ui components already imported for layout; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/BugUpsertPage.tsx",
          "operation": "modify",
          "description": "Replace mock submit flow with real add/update behavior using useAddBug/useUpdateBug and selected website id. For edit mode, prefill the form from selectedWebsite.bugs by bugId; if missing, show an error state with link back to /web-app-testing. Align form fields to backend-supported Bug fields (description + severity), and on success navigate back to /bugs (keeping the selected website via websiteSelection URL/localStorage). Use existing shadcn/ui form controls; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TestCaseUpsertPage.tsx",
          "operation": "modify",
          "description": "Replace mock submit flow with real add/update behavior using useAddTestCase/useUpdateTestCase and selected website id. For edit mode, prefill the form from selectedWebsite.testCases by testCaseId; if missing, show an error state with link back to /web-app-testing. Align form fields to backend-supported TestCase fields (description + steps), and on success navigate back to /test-cases (keeping the selected website via websiteSelection URL/localStorage). Use existing shadcn/ui form controls; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/BugListPage.tsx",
          "operation": "modify",
          "description": "Wire list -> detail navigation by making each bug row/card clickable (or adding an explicit 'View' action) to navigate to /bugs/$bugId. Ensure the list continues to use selectedWebsite from backend (no mock data). Use existing shadcn/ui Card/Button; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TestCaseListPage.tsx",
          "operation": "modify",
          "description": "Wire list -> detail navigation by making each test case row/card clickable (or adding an explicit 'View' action) to navigate to /test-cases/$testCaseId. Ensure the list continues to use selectedWebsite from backend (no mock data). Use existing shadcn/ui Card/Button; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure bug/test-case detail and upsert routes are protected consistently (wrap BugDetailPage, BugUpsertPage, TestCaseDetailPage, TestCaseUpsertPage routes in RequireAuth) so application data isn’t visible without authentication. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Render complete generated datasets on Web App Testing + list pages with usable scrolling and correct loading states for large lists",
      "acceptanceCriteria": [
        "After generating a website, the Web App Testing page shows all generated test cases/bugs/corner cases in their respective tabs without cutting off items.",
        "The Bugs and Test Cases pages display all items associated with the currently selected website id.",
        "Large lists remain usable (no missing items due to rendering or state issues)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/WebAppTestingPage.tsx",
          "operation": "modify",
          "description": "Improve large-list UX by ensuring each results tab renders the full arrays without truncation and remains scrollable (e.g., wrap tab lists in shadcn/ui ScrollArea with an appropriate height while keeping headers/actions visible). Preserve existing loading states (generateMutation pending, website loading) and ensure counts match list sizes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/BugListPage.tsx",
          "operation": "modify",
          "description": "Ensure the bugs list is scrollable and does not visually truncate when many items exist (e.g., wrap the list in shadcn/ui ScrollArea or apply safe overflow handling within the page layout). Keep the existing loading/empty/no-selection states correct. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TestCaseListPage.tsx",
          "operation": "modify",
          "description": "Ensure the test cases list is scrollable and does not visually truncate when many items exist (e.g., wrap the list in shadcn/ui ScrollArea or apply safe overflow handling within the page layout). Keep the existing loading/empty/no-selection states correct. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}